
#### Terraform Plan

```Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform/app_environment relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/cms/cms/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/cms/cms

To view this run in a browser, visit:
https://app.terraform.io/app/owenbendavies/cms-staging/runs/run-UEZ2cNWR24ApvJQt

Waiting for the plan to start...

Terraform v0.12.28
Configuring remote state backend...
Initializing Terraform configuration...
2020/07/11 12:06:50 [DEBUG] Using modified User-Agent: Terraform/0.12.28 TFC/eded2757df
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.aws_s3.data.aws_caller_identity.main: Refreshing state...
module.aws_iam.data.aws_iam_policy_document.ses: Refreshing state...
module.aws_cloudfront.data.aws_caller_identity.main: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws_cloudfront.aws_cloudfront_distribution.assets will be created
  + resource "aws_cloudfront_distribution" "assets" {
      + active_trusted_signers         = (known after apply)
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "obduk-cms-staging"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "environment" = "staging"
          + "project"     = "cms"
        }
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + target_origin_id       = "S3"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = false

              + cookies {
                  + forward = "none"
                }
            }
        }

      + logging_config {
          + bucket          = (known after apply)
          + include_cookies = false
          + prefix          = "AWSLogs/414063456747/cloudfront/obduk-cms-staging/"
        }

      + origin {
          + domain_name = (known after apply)
          + origin_id   = "S3"

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.aws_cloudfront.aws_cloudfront_origin_access_identity.assets will be created
  + resource "aws_cloudfront_origin_access_identity" "assets" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "obduk-cms-staging"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.aws_cognito.aws_cognito_user_group.admin will be created
  + resource "aws_cognito_user_group" "admin" {
      + id           = (known after apply)
      + name         = "admin"
      + user_pool_id = (known after apply)
    }

  # module.aws_cognito.aws_cognito_user_group.domains["obduk-cms-staging.herokuapp.com"] will be created
  + resource "aws_cognito_user_group" "domains" {
      + id           = (known after apply)
      + name         = "obduk-cms-staging.herokuapp.com"
      + user_pool_id = (known after apply)
    }

  # module.aws_cognito.aws_cognito_user_pool.app will be created
  + resource "aws_cognito_user_pool" "app" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "obduk-cms-staging"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "environment" = "staging"
          + "project"     = "cms"
        }
      + username_attributes        = [
          + "email",
        ]

      + admin_create_user_config {
          + allow_admin_create_user_only = true
          + unused_account_validity_days = (known after apply)
        }

      + lambda_config {
          + create_auth_challenge          = (known after apply)
          + custom_message                 = (known after apply)
          + define_auth_challenge          = (known after apply)
          + post_authentication            = (known after apply)
          + post_confirmation              = (known after apply)
          + pre_authentication             = (known after apply)
          + pre_sign_up                    = (known after apply)
          + pre_token_generation           = (known after apply)
          + user_migration                 = (known after apply)
          + verify_auth_challenge_response = (known after apply)
        }

      + password_policy {
          + minimum_length                   = (known after apply)
          + require_lowercase                = (known after apply)
          + require_numbers                  = (known after apply)
          + require_symbols                  = (known after apply)
          + require_uppercase                = (known after apply)
          + temporary_password_validity_days = (known after apply)
        }

      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "name"
          + required            = true

          + string_attribute_constraints {
              + max_length = "2048"
              + min_length = "0"
            }
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.aws_cognito.aws_cognito_user_pool_client.app will be created
  + resource "aws_cognito_user_pool_client" "app" {
      + allowed_oauth_flows                  = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client = true
      + allowed_oauth_scopes                 = [
          + "openid",
        ]
      + callback_urls                        = [
          + "https://obduk-cms-staging.herokuapp.com/auth/cognito-idp/callback",
        ]
      + client_secret                        = (sensitive value)
      + generate_secret                      = true
      + id                                   = (known after apply)
      + logout_urls                          = [
          + "https://obduk-cms-staging.herokuapp.com/",
        ]
      + name                                 = "obduk-cms-staging"
      + prevent_user_existence_errors        = (known after apply)
      + refresh_token_validity               = 30
      + supported_identity_providers         = [
          + "COGNITO",
        ]
      + user_pool_id                         = (known after apply)
    }

  # module.aws_cognito.aws_cognito_user_pool_domain.app will be created
  + resource "aws_cognito_user_pool_domain" "app" {
      + aws_account_id              = (known after apply)
      + cloudfront_distribution_arn = (known after apply)
      + domain                      = "obduk-cms-staging"
      + id                          = (known after apply)
      + s3_bucket                   = (known after apply)
      + user_pool_id                = (known after apply)
      + version                     = (known after apply)
    }

  # module.aws_iam.data.aws_iam_policy_document.cognito will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cognito"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "cognito-idp:ListUsersInGroup",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.aws_iam.data.aws_iam_policy_document.s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:GetObjectAcl",
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.aws_iam.aws_iam_access_key.app will be created
  + resource "aws_iam_access_key" "app" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password    = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "obduk-cms-staging"
    }

  # module.aws_iam.aws_iam_user.app will be created
  + resource "aws_iam_user" "app" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "obduk-cms-staging"
      + path          = "/"
      + tags          = {
          + "environment" = "staging"
          + "project"     = "cms"
        }
      + unique_id     = (known after apply)
    }

  # module.aws_iam.aws_iam_user_policy.app_cognito will be created
  + resource "aws_iam_user_policy" "app_cognito" {
      + id     = (known after apply)
      + name   = "cognito"
      + policy = (known after apply)
      + user   = "obduk-cms-staging"
    }

  # module.aws_iam.aws_iam_user_policy.app_s3 will be created
  + resource "aws_iam_user_policy" "app_s3" {
      + id     = (known after apply)
      + name   = "s3"
      + policy = (known after apply)
      + user   = "obduk-cms-staging"
    }

  # module.aws_iam.aws_iam_user_policy.app_ses will be created
  + resource "aws_iam_user_policy" "app_ses" {
      + id     = (known after apply)
      + name   = "ses"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ses:SendRawEmail"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user   = "obduk-cms-staging"
    }

  # module.aws_s3.data.aws_iam_policy_document.assets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assets"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.aws_s3.aws_s3_bucket.assets will be created
  + resource "aws_s3_bucket" "assets" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "obduk-cms-staging"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "environment" = "staging"
          + "project"     = "cms"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 1
          + enabled                                = true
          + id                                     = "delete-old-versions"

          + noncurrent_version_expiration {
              + days = 30
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = "AWSLogs/414063456747/s3/obduk-cms-staging/"
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.aws_s3.aws_s3_bucket.logs will be created
  + resource "aws_s3_bucket" "logs" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = "obduk-cms-staging-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "environment" = "staging"
          + "project"     = "cms"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 1
          + enabled                                = true
          + id                                     = "delete-old-files-and-versions"

          + expiration {
              + days = 30
            }

          + noncurrent_version_expiration {
              + days = 30
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.aws_s3.aws_s3_bucket_policy.assets will be created
  + resource "aws_s3_bucket_policy" "assets" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.aws_s3.aws_s3_bucket_public_access_block.assets will be created
  + resource "aws_s3_bucket_public_access_block" "assets" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.aws_s3.aws_s3_bucket_public_access_block.logs will be created
  + resource "aws_s3_bucket_public_access_block" "logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.heroku.heroku_addon.app_librato will be created
  + resource "heroku_addon" "app_librato" {
      + app         = "obduk-cms-staging"
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "librato:development"
      + provider_id = (known after apply)
    }

  # module.heroku.heroku_addon.app_logentries will be created
  + resource "heroku_addon" "app_logentries" {
      + app         = "obduk-cms-staging"
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "logentries:le_tryit"
      + provider_id = (known after apply)
    }

  # module.heroku.heroku_addon.app_postgresql will be created
  + resource "heroku_addon" "app_postgresql" {
      + app         = "obduk-cms-staging"
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "heroku-postgresql:hobby-dev"
      + provider_id = (known after apply)
    }

  # module.heroku.heroku_addon.app_rollbar will be created
  + resource "heroku_addon" "app_rollbar" {
      + app         = "obduk-cms-staging"
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "rollbar:free"
      + provider_id = (known after apply)
    }

  # module.heroku.heroku_addon.app_scheduler will be created
  + resource "heroku_addon" "app_scheduler" {
      + app         = "obduk-cms-staging"
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "scheduler:standard"
      + provider_id = (known after apply)
    }

  # module.heroku.heroku_addon.app_scout will be created
  + resource "heroku_addon" "app_scout" {
      + app         = "obduk-cms-staging"
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "scout:chair"
      + provider_id = (known after apply)
    }

  # module.heroku.heroku_app.app will be created
  + resource "heroku_app" "app" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = [
          + "heroku/nodejs",
          + "heroku/ruby",
        ]
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "obduk-cms-staging"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = "heroku-18"
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # module.heroku.heroku_app_feature.api_runtime_dyno_metadata will be created
  + resource "heroku_app_feature" "api_runtime_dyno_metadata" {
      + app     = "obduk-cms-staging"
      + enabled = true
      + id      = (known after apply)
      + name    = "runtime-dyno-metadata"
    }

  # module.heroku.heroku_app_feature.app_log_runtime_metrics will be created
  + resource "heroku_app_feature" "app_log_runtime_metrics" {
      + app     = "obduk-cms-staging"
      + enabled = true
      + id      = (known after apply)
      + name    = "log-runtime-metrics"
    }

  # module.heroku.heroku_formation.app_web will be created
  + resource "heroku_formation" "app_web" {
      + app      = "obduk-cms-staging"
      + id       = (known after apply)
      + quantity = 1
      + size     = "Free"
      + type     = "web"
    }

  # module.heroku.heroku_formation.app_worker will be created
  + resource "heroku_formation" "app_worker" {
      + app      = "obduk-cms-staging"
      + id       = (known after apply)
      + quantity = 1
      + size     = "Free"
      + type     = "worker"
    }

Plan: 28 to add, 0 to change, 0 to destroy.
```
